OdGeMatrix2d.scaling(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which scales
by scale about center.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.

OdGeMatrix2d.setToScaling(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which scales
by scale about center, and returns a reference
to this matrix.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.